haimianxx/stm32-/BSP/Src/bsp_uart_fifo.c
		/* 改写FIFO读索引 */
		DISABLE_INT();
		if (++_pUart->usRxRead >= _pUart->usRxBufSize)
		{
			_pUart->usRxRead = 0;
		}
		_pUart->usRxCount--;
		ENABLE_INT();
		return 1;
	}
}

/*
*********************************************************************************************************
*   函 数 名: UartTxEmpty
*   功能说明: 判断发送缓冲区是否为空。
*   形    参:  _pUart : 串口设备
*   返 回 值: 1为空。0为不空。
*********************************************************************************************************
*/
uint8_t UartTxEmpty(COM_PORT_E _ucPort)
{
   UART_T *pUart;
   uint8_t Sending;
   
   pUart = ComToUart(_ucPort);
   if (pUart == 0)
   {
      return 0;
   }

   Sending = pUart->Sending;

   if (Sending != 0)
   {
      return 0;
   }
   return 1;
}

/*
*********************************************************************************************************
*	函 数 名: UartIRQ
*	功能说明: 供中断服务程序调用，通用串口中断处理函数
*	形    参: _pUart : 串口设备
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartIRQ(UART_T *_pUart)
{
	uint32_t isrflags   = READ_REG(_pUart->uart->SR);  // 读状态寄存器 RXNE、TXE、TC、ORE、FE 等状态标志位
	uint32_t cr1its     = READ_REG(_pUart->uart->CR1); // 读控制寄存器1 TXEIE、TCIE、RXNEIE 等中断使能位
	// uint32_t cr3its     = READ_REG(_pUart->uart->CR3); // 读控制寄存器3 CTSIE、EIE、DMAR、DMAT 等
	
	/* 处理接收中断  */
	if ((isrflags & USART_SR_RXNE) != RESET)
	{
		//注意：RXNE 不能软件清零，只能通过读 DR 自动清零。所以这个 if 进去后读一次 DR，出来后标志位就自动恢复了
		/* 从串口接收数据寄存器读取数据存放到接收FIFO */
		uint8_t ch;

		ch = READ_REG(_pUart->uart->DR); // 读数据寄存器 → 自动清 RXNE
		_pUart->pRxBuf[_pUart->usRxWrite] = ch; // 存入环形缓冲区
		if (++_pUart->usRxWrite >= _pUart->usRxBufSize)
		{
			_pUart->usRxWrite = 0;
		}
		if (_pUart->usRxCount < _pUart->usRxBufSize)
		{
			_pUart->usRxCount++;
		}

		/* 回调函数,通知应用程序收到新数据,一般是发送1个消息或者设置一个标记 */
		//if (_pUart->usRxWrite == _pUart->usRxRead)
		//if (_pUart->usRxCount == 1)
		{
			if (_pUart->ReciveNew)
			{
				_pUart->ReciveNew(ch); /* 比如，交给MODBUS解码程序处理字节流 */
			}
		}
	}

	/* 处理发送缓冲区空中断 */
	if ( ((isrflags & USART_SR_TXE) != RESET)   // SR 寄存器: TXE 标志 = 1 (数据寄存器空)
		&& (cr1its & USART_CR1_TXEIE) != RESET) // CR1 寄存器: 用于决定是否允许TXE标志触发中断
	{
		//if (_pUart->usTxRead == _pUart->usTxWrite)
		if (_pUart->usTxCount == 0) 
		{
			/* 发送缓冲区的数据已取完时， 禁止发送缓冲区空中断 （注意：此时最后1个数据还未真正发送完毕）*/
			//USART_ITConfig(_pUart->uart, USART_IT_TXE, DISABLE);
			CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TXEIE);  // 关 TXE 中断(不允许 TXE 标志触发中断)

			/* 使能数据发送完毕中断 */
			//USART_ITConfig(_pUart->uart, USART_IT_TC, ENABLE);
			SET_BIT(_pUart->uart->CR1, USART_CR1_TCIE); // 开 TC 中断 移位寄存器所有位（含停止位）全部从引脚发出时
		}
		else
		{
			_pUart->Sending = 1;  // 标记"正在发送"
			
			/* 从发送FIFO取1个字节写入串口发送数据寄存器 */
			//USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
			_pUart->uart->DR = _pUart->pTxBuf[_pUart->usTxRead]; //从 FIFO 取1字节写入 DR
			if (++_pUart->usTxRead >= _pUart->usTxBufSize)  // 读指针推进+回绕
			{
				_pUart->usTxRead = 0;
			}
			_pUart->usTxCount--;// 待发送计数-1
		}

	}
	/* 数据bit位全部发送完毕的中断 */
	if (((isrflags & USART_SR_TC) != RESET) 		// SR: TC 标志 = 1（发送真正完成）
		&& ((cr1its & USART_CR1_TCIE) != RESET))	// CR1: 用于决定是否允许TC 标志触发中断
	{
		//if (_pUart->usTxRead == _pUart->usTxWrite)
		if (_pUart->usTxCount == 0)
		{
			/* 如果发送FIFO的数据全部发送完毕，禁止数据发送完毕中断 */
			//USART_ITConfig(_pUart->uart, USART_IT_TC, DISABLE);
			CLEAR_BIT(_pUart->uart->CR1, USART_CR1_TCIE);

			/* 回调函数, 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
			if (_pUart->SendOver)
			{
				_pUart->SendOver();
			}
			
			_pUart->Sending = 0;
		}
		else
		{
			/* 正常情况下，不会进入此分支 */

			/* 如果发送FIFO的数据还未完毕，则从发送FIFO取1个数据写入发送数据寄存器 */
			//USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
			_pUart->uart->DR = _pUart->pTxBuf[_pUart->usTxRead];
			if (++_pUart->usTxRead >= _pUart->usTxBufSize)
			{
				_pUart->usTxRead = 0;
			}
			_pUart->usTxCount--;
		}
	}
}

/*
*********************************************************************************************************
*	函 数 名: USART1_IRQHandler  USART2_IRQHandler USART3_IRQHandler UART4_IRQHandler UART5_IRQHandler等
*	功能说明: USART中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#if UART1_FIFO_EN == 1
void USART1_IRQHandler(void)
{
	UartIRQ(&g_tUart1);
}
#endif

#if UART2_FIFO_EN == 1
void USART2_IRQHandler(void)
{
	UartIRQ(&g_tUart2);
}
#endif

#if UART3_FIFO_EN == 1
void USART3_IRQHandler(void)
{
	UartIRQ(&g_tUart3);
}
#endif

#if UART4_FIFO_EN == 1
void UART4_IRQHandler(void)
{
	UartIRQ(&g_tUart4);
}
#endif

#if UART5_FIFO_EN == 1
void UART5_IRQHandler(void)
{
	UartIRQ(&g_tUart5);
}
#endif


/*
*********************************************************************************************************
*	函 数 名: fputc
*	功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
// int fputc(int ch, FILE *f)
// {
// #if 1	/* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
// 	comSendChar(COM1, ch);
	
// 	return ch;
// #else	/* 采用阻塞方式发送每个字符,等待数据发送完毕 */
// 	/* 写一个字节到USART1 */
// 	USART1->DR = ch;
	
// 	/* 等待发送结束 */
// 	while((USART1->SR & USART_SR_TC) == 0)
// 	{}
	
// 	return ch;
// #endif
// }

/*
*********************************************************************************************************
*	函 数 名: __io_putchar
*	功能说明: 重定义__io_putchar，printf底层会调用此函数输出字符
*	形    参: ch - 要输出的字符
*	返 回 值: 输出的字符
*********************************************************************************************************
*/
// int __io_putchar(int ch)
// {
// 	comSendChar(COM1, ch);
// 	return ch;
// }

/*
*********************************************************************************************************
*	函 数 名: fgetc
*	功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
// int fgetc(FILE *f)
// {

// #if 1	/* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
// 	uint8_t ucData;

// 	while(comGetChar(COM1, &ucData) == 0);

// 	return ucData;
// #else
// 	/* 等待接收到数据 */
// 	while((USART1->SR & USART_SR_RXNE) == 0)
// 	{}

// 	return (int)USART1->DR;
// #endif
// }

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
